Jack-Herron/STM32_Skipper_Development/Sensor_Board/Src/main.c
#include <stdint.h>
#include <stdio.h>
#include "stm32f1xx.h"
#include "clock.h"
#include "indicate.h"
#include "CAN.h"
#include "ADC.h"
#include "main.h"

uint8_t setup_Complete = 0;
uint8_t setpoint = 0;
uint8_t soil_Moisture_Percent = 0;

void TIM3_Init(void)
{
    RCC->APB1ENR |= RCC_APB1ENR_TIM3EN;   // Enable TIM5 clock

    TIM3->CR1 = 0;                        // Upcounting, edge-aligned, disabled during setup
    TIM3->PSC = 71;                       // 72 MHz / (71 + 1) = 1 MHz
    TIM3->ARR = 99999;                    // 1 MHz / (99999 + 1) = 10 Hz (100 ms)

    TIM3->CNT = 0;                        // Clear counter

    TIM3->DIER |= TIM_DIER_UIE;           // Enable update interrupt
    TIM3->EGR |= TIM_EGR_UG;              // Load prescaler immediately

    NVIC_EnableIRQ(TIM3_IRQn);            // Enable TIM5 interrupt

    TIM3->CR1 |= TIM_CR1_CEN;             // Start timer
}

void TIM2_Init(void)
{
    /* Enable clocks */
    RCC->APB2ENR |= RCC_APB2ENR_IOPBEN;   // GPIOA clock
    RCC->APB1ENR |= RCC_APB1ENR_TIM2EN;   // TIM2 clock
    RCC->APB2ENR |= RCC_APB2ENR_AFIOEN;   // Enable AFIO clock

    AFIO->MAPR &= ~AFIO_MAPR_TIM2_REMAP;
    AFIO->MAPR |=  AFIO_MAPR_TIM2_REMAP_1;   // Partial remap

    GPIOB->CRH &= ~(GPIO_CRH_MODE10 	| GPIO_CRH_CNF10);
    GPIOB->CRH |=  (GPIO_CRH_MODE10_1 	| GPIO_CRH_MODE10_0);   // Output 50 MHz
    GPIOB->CRH |=  (GPIO_CRH_CNF10_1);                      	// AF push-pull

    TIM2->CR1 = 0;
    TIM2->PSC = 71;        // 36 MHz / (71+1) = 1 MHz timer clock
    TIM2->ARR = 99;       // 1 MHz / (99+1) = 10 kHz PWM frequency
    TIM2->CNT = 0;

    TIM2->CCR3 = 50;      // 50% duty cycle
    TIM2->CCMR2 &= ~TIM_CCMR2_OC3M;
    TIM2->CCMR2 |= (6 << TIM_CCMR2_OC3M_Pos); // PWM mode 1
    TIM2->CCMR2 |= TIM_CCMR2_OC3PE;           // Enable preload for CCR1

    TIM2->CCER |= TIM_CCER_CC3E;
    TIM2->CR1 |= TIM_CR1_ARPE;
    TIM2->EGR |= TIM_EGR_UG;
    TIM2->CR1 |= TIM_CR1_CEN;
}

void set_Motor_Speed(uint16_t speed)
{
	TIM2->CCR3 = speed;
}
void RX_Callback(CAN___Receive_TypeDef packet)
{
	switch(packet.ID)
	{
	case 0x110:
		setpoint = packet.data[0];
		break;
	}
}

uint8_t voltage_To_Moisture(float voltage)
{
    const float V_WET = 1.1f;
    const float V_DRY = 1.7f;

    if (voltage <= V_WET)
        return 100;

    if (voltage >= V_DRY)
        return 0;

    float moisture = (V_DRY - voltage) / (V_DRY - V_WET);

    return (uint8_t)(moisture * 100.0f);
}

int main(void)
{
	clock___Init();
	indicate___Init();
	CAN___Init();
	CAN___Accept_All_Messages();
	CAN___Set_RX_Callback(RX_Callback);
	ADC___Init();
	TIM3_Init();
	TIM2_Init();

	setup_Complete = 1;

	GPIOB->CRH &= ~GPIO_CRH_MODE15_Msk;				// Clear PB15 mode
	GPIOB->CRH &= ~GPIO_CRH_CNF15_Msk;				// clear PB15 configuration

	GPIOB->ODR |= GPIO_ODR_ODR15;					// Clear

	GPIOB->CRH |= GPIO_CRH_MODE15_0;				// Set PB15 to output (slow)


	for(;;)
	{
//		printf("{\"soil_moisture_1\":%d,\"soil_moisture_2\":%d,\"soil_moisture_3\":%d}\n",
//		       voltage_To_Moisture(ADC___Get_Voltage(1)),
//		       voltage_To_Moisture(ADC___Get_Voltage(2)),
//		       voltage_To_Moisture(ADC___Get_Voltage(3)));
		soil_Moisture_Percent = voltage_To_Moisture(ADC___Get_Voltage(3));

		if(soil_Moisture_Percent < setpoint)
		{
			set_Motor_Speed(100);
		}
		else
		{
			set_Motor_Speed(0);
		}

  		clock___Delay_ms(50);
	}
}

void TIM3_IRQHandler(void)				// 10Hz CAN status interrupt
{
    if (TIM3->SR & TIM_SR_UIF)
    {
        TIM3->SR &= ~TIM_SR_UIF;          // Clear interrupt flag

        CAN_Tansmit_TypeDef payload;
        payload.ID = 0x210;
        payload.data_Length = 1;
        payload.data[0] = soil_Moisture_Percent;
        CAN___Transmit(payload);

        payload.ID = 0x211;
        payload.data_Length = 1;
        payload.data[0] = soil_Moisture_Percent;
        CAN___Transmit(payload);
    }
}
